#递归：

               #定义斐波那契数列:1,1,2,3,5,8,13,21,34,......n
               #即:每一个数列为前两个数列之和：f(1)=1,f(2)=2,f(n)=f(n-1)+f(n-2)(n>=2且n属于正整数）:
# def fib(n):
#     if n == 1:
#         return 1
#     if n == 2:
#         return 1    #定义前两个值=1
#     return fib(n-1)+fib(n-2)     #调用自己，实现递归
# print(fib(20))     #n = 20,即斐波那契数列的第20个值，输出结果为：6765

#前二十个斐波那契数列中的数分别为：
Q = []   #接收数列
for i in range(20):
    if i == 0 or i == 1:
        Q.append(1)
    else:
        Q.append(Q[i-2]+Q[i-1])
    print("前二十个斐波那契数分别为：",Q)


