# !/usr/bin/env python
# -*- coding: utf-8 -*-
# 写在前面:
# Python内置的数学计算与统计函数差不多，但基本够用。不过，如果要用对数学函数和三角函数，
# 还需要导入内置的math模块，或使用其他模块，如科学计算模块NumPy等。有人说，做开方运算
# 就得导入math模块，其实内置函数pow()既可以做乘方运算，也可以做开方运算。

sum([3,4,5])
print(sum([3,4,5]))

min(3,4,5), max(3,4,5) # min()/max()函数可以接受多个参数
print(min(3,4,5), max(3,4,5))

min([3,4,5]), max([3,4,5]) # min()/max()函数可以接受列表或元组做参数
print(min([3,4,5]), max([3,4,5]))

abs(-3.14)
pow(2,3) # 计算2的3次方
print(pow(2,3))

pow(2,1/2) # 开平方
print(pow(2,1/3))

divmod(5,2) # 以元组形式返回5/2的商和余数。这在某些仓何用起来非常高效、优雅
print(divmod(5,2))

round(3.1415926) # 取整
print(round(3.1415926))

round(3.1415926,5) # 精确到小数点后5位
print(round(3.1415926,5))